{
  "projects": [
    {
      "title": "T'Station",
      "img": "/images/t-station.png",
      "info": ["Coin Trading App Built with Vue3", "타라소프트"],
      "position": ["Front-end", "Back-end"],
      "date": ["JANUARY", "2026"],
      "collaborator": ["MIN", "X", "HYUN"],
      "url": "https://www.tstation.com/",
      "color": "#2a3138",
      "post": [
        {
          "type": "image",
          "content": "/images/t-station/t-station-main.png",
          "size": "1000×640"
        },
        {
          "type": "text",
          "content": "Nuxt3(Vue3)와 TypeScript를 기반으로 한 코인 지갑 및 거래 웹 애플리케이션 템플릿을 설계·구현하였습니다.사용자 영역에서는 로그인, 지갑 조회, 코인 전송·교환, 거래 내역 확인 기능을 제공하고, 관리자 영역에서는 회원 관리, 코인 지급, 공지·문의 관리 등 운영에 필요한 기능을 포함합니다. 페이지 로직과 비즈니스 로직을 분리한 구조로 유지보수성과 확장성을 고려하였으며, Pinia 기반 상태 관리와 공통 Base 컴포넌트 설계를 통해 일관된 사용자 경험을 구현했습니다. 실제 서비스 운영 환경을 가정한 구조로 개발하여, 금융 서비스 성격의 웹 애플리케이션 아키텍처와 운영 관점의 개발 경험을 쌓았습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup1.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 메인 화면 UI를 모바일 환경에 맞춰 구현한 화면으로, 상단에는 검색 중심의 헤더 구조와 빠른 메뉴 접근을 배치하여 차량 번호·차종·사이즈 기반 타이어 탐색 흐름을 강화했습니다. 메인 배너와 브랜드 바로가기 영역은 Swiper 기반 컴포넌트로 구성하여 이벤트 및 주요 브랜드 노출을 유연하게 제어할 수 있도록 설계했으며, Top5 타이어 영역에서는 상품 카드 컴포넌트를 공통화해 가격 등급, 리뷰 점수, 태그 정보를 일관되게 표현했습니다. 리뷰 섹션은 실제 구매 데이터를 기반으로 한 요약 배지와 주행 거리 조건을 함께 노출하도록 구성했으며, Pinia 기반 productStore와 reviewStore를 분리해 상품 정보와 리뷰 상태를 독립적으로 관리했습니다. 데이터 로딩 시에는 useAsyncData와 fetchTopProducts, fetchTopReviews 서비스 함수를 활용해 SSR 환경에서도 초기 렌더링 속도를 확보했으며, TailwindCSS 유틸리티 클래스를 사용해 카드 간 간격, 반응형 레이아웃, 브랜드 컬러 강조를 효율적으로 제어했습니다. 하단 활용 가이드 영역은 기능 단위로 컴포넌트를 분리하여 추후 서비스 확장 시에도 재사용이 가능하도록 설계된 구조입니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup2.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 모바일 서비스의 메뉴 오버레이 화면과 로그인 화면입니다. 좌측 화면은 전체 메뉴 탐색 구조로, 타이어 쇼핑·경정비·제공 서비스 카테고리를 중심으로 브랜드별·차종별 쇼핑 플로우를 명확히 분리했으며, Nuxt3 환경에서 MenuDrawer 컴포넌트와 Pinia의 menuStore를 활용해 열림 상태와 선택 메뉴를 관리하는 구조로 설명할 수 있습니다. 우측 로그인 화면은 BaseInput과 BaseButton 컴포넌트를 사용해 아이디·비밀번호 입력과 로그인 액션을 통일된 UI로 제공하고, Pinia의 authStore에서 로그인 상태와 토큰을 관리하며 login(), socialLogin() 서비스 함수를 통해 일반 로그인과 간편 로그인을 분기 처리하는 흐름으로 구현되었습니다. 각 화면은 잘림 없이 contain 방식으로 스케일링하고 남는 여백은 동일 화면을 블러 처리한 배경으로 채워 시각적 이질감을 최소화했으며, TailwindCSS 유틸을 활용해 여백, 버튼 크기, 정렬 규칙을 일관되게 유지한 구조입니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup3.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 회원가입 플로우를 구현한 UI로, 최초 진입 시 간편 회원가입 선택 화면에서 이메일 가입과 카카오·네이버·Apple 소셜 가입을 분기 처리하도록 구성했습니다. 소셜 로그인 버튼은 공통 SocialAuthButton 컴포넌트로 분리하고 provider 타입을 props로 전달해 authService.socialLogin(provider) 함수로 인증 플로우를 제어했으며, 이메일 가입 선택 시 회원가입 폼 페이지로 라우팅되도록 설계했습니다. 회원가입 입력 화면에서는 BaseInput과 BaseCheckBox 컴포넌트를 사용해 아이디, 비밀번호, 휴대폰 번호, 약관 동의 UI를 통일했고, 입력값과 체크 상태는 Pinia의 authStore에서 formState와 agreementState로 관리했습니다. 아이디 중복확인은 checkDuplicateEmail API를 통해 비동기 검증을 수행하고, 비밀번호는 validatePassword, matchPassword 유틸 함수로 규칙 검증과 일치 여부를 실시간으로 체크하도록 구현했습니다. 약관 전체 선택은 개별 약관 상태를 computed로 묶어 처리했으며, 필수 약관 충족 시에만 submitSignup() 함수가 호출되어 회원가입 요청이 가능하도록 제어하는 구조입니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup4.png",
          "size": "2000x2000"
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup5.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 상품 검색 플로우를 구현한 UI로, 검색 진입 화면에서 차량번호·차종·사이즈 중 하나를 선택해 탐색 경로를 분기하도록 설계했습니다. 상단 검색 입력은 BaseSearchInput 컴포넌트로 구성하고 입력값과 검색 타입은 Pinia의 searchStore에서 keyword, searchType 상태로 관리하며, 입력 변경 시 debounceSearch 유틸을 통해 불필요한 API 호출을 방지했습니다. 차종 검색 결과 리스트는 VehicleModelList 컴포넌트에서 렌더링하고 fetchVehicleModels API 호출 결과를 연식 기준으로 정렬해 사용자 선택 시 modelCode를 기준으로 다음 단계로 라우팅되도록 처리했습니다. 사이즈 검색 화면에서는 단면폭·편평비·인치 단계를 순차 선택하는 구조로 구현했으며, 선택 값은 sizeState로 누적 관리하고 computed 기반 isSelectable 로직으로 다음 단계 활성화를 제어했습니다. 모든 검색 조건이 충족되면 buildSearchQuery 유틸로 파라미터를 조합해 상품 리스트 페이지로 이동하도록 구성된 흐름입니다."
        },
        {
          "type": "text",
          "content": "브랜드 선택 → 차종 선택 → 세부 모델 선택의 단계적 탐색 구조로 설계했습니다. 초기 브랜드 선택 화면에서는 브랜드 목록을 BrandGrid 컴포넌트로 구성하고, 선택 시 Pinia의 searchStore에 brandCode를 저장한 뒤 차종 리스트 화면으로 라우팅되도록 처리했습니다. 차종 리스트는 fetchVehicleByBrand API 호출 결과를 기반으로 VehicleList 컴포넌트에서 렌더링하며, 검색어 입력 시 keyword 상태를 반영해 computed 필터링으로 즉시 결과를 갱신하도록 구현했습니다. 특정 차종 선택 후에는 연식·세대 정보를 포함한 모델 리스트를 노출하고, 선택된 modelCode와 generation 정보를 searchStore에 누적 저장해 다음 단계 검색 조건으로 활용합니다. 모든 선택 값은 buildSearchQuery 유틸을 통해 공통 파라미터 형태로 정리되며, 최종적으로 상품 리스트 페이지에서 해당 조건을 기반으로 타이어 결과를 조회하는 흐름으로 구성되어 있습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup6.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 차량 정보 확정 이후 상품 탐색 단계까지 이어지는 흐름을 Nuxt3(Vue3) 기반으로 구현한 결과 화면으로, 차량·연식·세부모델 선택에 따라 기본 타이어 사이즈를 자동 세팅하도록 설계했습니다. 차량 정보 영역은 vehicleStore에서 관리하며 연식과 세부모델 변경 시 resolveDefaultTireSize 유틸을 호출해 공장 출고 기준 사이즈를 계산하고, 해당 값은 Pinia 상태에 반영됩니다. 상품 영역에서는 tire, care(엔진오일·배터리) 카테고리를 공통 ProductList 컴포넌트로 구성하고, 선택된 탭과 필터 조건은 queryState로 관리해 재검색 시에도 유지되도록 처리했습니다. 가격대·추천순·카테고리 필터는 computed 기반으로 즉시 반응하도록 구성했으며, 상품 데이터는 fetchProducts API에서 차량 파라미터와 함께 조회해 서버 필터링과 클라이언트 정렬을 병행하는 구조로 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup7.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "상품 상세 진입 시 useRoute의 params로 sku를 받아 productService.getProductDetail로 데이터를 조회하고, Pinia의 useProductStore에 상세/리뷰/비교 데이터를 분리 저장해 탭 전환 시 재요청을 최소화하도록 구성했다고 가정했습니다. 가격 영역은 formatPrice 유틸과 할인율 계산 함수(calcDiscountRate)를 통해 쿠폰가/혜택가를 동기화하며, 비교 모달은 useModalStore로 열림 상태와 선택된 비교 타입(금액/성능)을 관리해 동일 컴포넌트를 재사용하도록 설계했습니다. UI는 TailwindCSS로 카드, 배지, CTA 버튼을 일관된 토큰으로 구성하고, 리스트 영역은 가로 스크롤 캐러셀을 snap-x 기반으로 구현해 터치 스크롤 경험을 자연스럽게 만든 흐름입니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup8.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 타이어 상품 구매 플로우(수량 선택 바텀시트, 구매 확인 모달, 사이즈 확인 안내, 장착 매장 선택)를 하나의 흐름으로 구성한 UI, 페이지 전환 구조에서 구매하기 버튼 클릭 시 openPurchaseSheet 함수로 바텀시트를 노출하고 선택 수량은 Pinia의 orderStore에서 reactive state로 관리되도록 설계했습니다. 수량 변경에 따라 calcTotalPrice 유틸을 통해 총 상품금액과 할인금액을 즉시 재계산하며, 확인 버튼 클릭 시 confirmPurchaseModal을 호출해 공통 Modal 컴포넌트로 구매 의사를 재확인하는 흐름입니다. 이후 타이어 사이즈 검증 단계에서는 route middleware에서 선택된 사이즈를 검증하고 불일치 시 SizeGuide 페이지로 이동하도록 처리했으며, 매장 선택 화면에서는 useStoreSearch composable을 통해 지역/매장명 조건을 관리하고 결과 리스트를 지도 보기와 리스트 보기로 전환할 수 있도록 구현했다고 가정했습니다. 전체 UI는 TailwindCSS 기반 카드·버튼 컴포넌트를 재사용해 일관성을 유지하고, 모든 상태는 Pinia 스토어 중심으로 단방향 데이터 흐름을 갖도록 구성했습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup9.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 타이어 구매 과정에서 ‘장착일/시간 선택 → 차량 정보 입력 → 주문/결제 요약’으로 이어지는 핵심 플로우를 3개의 모바일 화면으로 구성한 목업입니다. 각 화면을 페이지 단위로 분리하고, Pinia의 orderStore에서 선택 매장/장착일시/차량정보(브랜드·차종·연료·연식·타이어사이즈 등)를 단일 상태로 관리하여 단계 이동 시에도 입력값이 유지되도록 설계했습니다. 날짜/시간 선택 영역은 formatDateTime 유틸로 ‘YYYY.MM.DD(요일) / HH:mm’ 형태로 표준화해 표시하고, 선택 가능한 슬롯은 getAvailableSlots 함수에서 API 응답을 정규화한 뒤 disabled 조건을 계산해 버튼 상태로 반영했습니다. 입력 폼은 Tailwind로 동일한 간격/라운드/포커스 스타일을 유지했으며, validateVehicleForm 유틸로 필수값과 포맷을 검증한 뒤 통과 시에만 다음 단계로 진행하도록 가드했습니다. 최종 요약 화면에서는 computeOrderSummary(가격/수량/할인)를 통해 금액 정보를 계산하고, submitOrder 서비스 함수로 결제 직전 payload를 생성해 전송하도록 구성하여 화면은 얇게 유지하고 로직은 store·service·utils로 분리한 구조로 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup10.png",
          "size": "2000x2000"
        },
        {
          "type": "text",
          "content": "본 화면은 주문/결제 마지막 단계에서 결제 정보 확인 화면과 EasyPay 결제수단 선택 화면을 하나의 흐름으로 구성한 UI로, 주문 요약 데이터는 Pinia의 orderStore 상태를 기준으로 렌더링되며 총 상품금액, 할인금액, 최종 결제금액은 calcPaymentSummary 유틸 함수를 통해 계산된 값을 사용합니다. 약관 동의 체크 여부는 reactive formState로 관리하여 필수 동의 미체크 시 결제 버튼이 비활성화되도록 처리했으며, 결제하기 버튼 클릭 시 openEasyPay() 액션을 통해 외부 결제 모듈을 오버레이 형태로 호출하는 구조입니다. EasyPay 화면에서는 selectedMethod 상태로 신용카드, 간편결제, 계좌이체, 가상계좌 중 하나만 선택되도록 제어하고, 다음 버튼 클릭 시 buildPaymentPayload 유틸로 결제 요청 데이터를 생성해 결제 API로 전달하도록 설계했습니다. 전체 화면은 TailwindCSS 기반 섹션 카드와 하단 고정 CTA 패턴을 공통 컴포넌트로 사용해 결제 단계에서도 일관된 사용자 경험을 유지하도록 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/t-station/tstation_mockup11.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "앱의 all my T 진입 오버레이 UI를 구현한 화면으로, 단일 페이지 구조에서 글로벌 딤 처리와 플로팅 메뉴를 결합한 인터랙션을 중심으로 설계했습니다. 홈 화면 진입 시 Pinia의 commonStore에서 isAllMyTOpen 상태를 제어하여 배경을 어둡게 처리하고, 중앙 CTA 영역은 Teleport를 활용해 최상단 레이어로 렌더링되도록 구성했습니다. 원형 퀵 메뉴는 v-for 기반 아이콘 리스트로 구성하고, 각 메뉴 클릭 시 routeMap 유틸을 통해 목적 페이지로 이동하도록 처리했으며, 알림 뱃지와 최근 본 상품 카운트는 userActivityStore 상태를 참조해 동적으로 표시됩니다. 전체 UI는 TailwindCSS의 fixed, inset, z-index 유틸을 활용해 모바일 환경에서도 안정적인 레이어 구조를 유지하도록 구현했습니다."
        }
      ]
    },
    {
      "title": "TARA WALLET",
      "img": "/images/tara-wallet.png",
      "info": ["Coin Trading App Built with Vue3", "타라소프트"],
      "position": ["Front-end", "Back-end"],
      "date": ["DECEMBER", "2025"],
      "collaborator": ["MIN", "X", "HYUN"],
      "url": "",
      "color": "#ff6616",
      "post": [
        {
          "type": "image",
          "content": "/images/tara-wallet.png",
          "size": "1000×640"
        },
        {
          "type": "text",
          "content": "Nuxt3(Vue3)와 TypeScript를 기반으로 한 코인 지갑 및 거래 웹 애플리케이션 템플릿을 설계·구현하였습니다.사용자 영역에서는 로그인, 지갑 조회, 코인 전송·교환, 거래 내역 확인 기능을 제공하고, 관리자 영역에서는 회원 관리, 코인 지급, 공지·문의 관리 등 운영에 필요한 기능을 포함합니다. 페이지 로직과 비즈니스 로직을 분리한 구조로 유지보수성과 확장성을 고려하였으며, Pinia 기반 상태 관리와 공통 Base 컴포넌트 설계를 통해 일관된 사용자 경험을 구현했습니다. 실제 서비스 운영 환경을 가정한 구조로 개발하여, 금융 서비스 성격의 웹 애플리케이션 아키텍처와 운영 관점의 개발 경험을 쌓았습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa1.png",
          "size": "1920x1080"
        },
        {
          "type": "text",
          "content": "Nuxt3의 파일 기반 라우팅을 활용해 로그인과 회원가입 화면을 분리하고 `definePageMeta`로 인증 전·후 화면 흐름을 명확하게 구성했습니다. 페이지 이동은 `navigateTo`를 사용해 모바일 환경에서도 자연스럽게 전환되도록 했습니다. Pinia를 사용해 로그인·회원가입 폼의 입력값, 로딩 상태, 에러 메시지를 전역으로 관리했습니다. 제출 상태(isSubmitting)와 UI 제어 로직을 스토어로 분리해 페이지 컴포넌트는 최대한 단순하게 유지했습니다. Vue3의 ref, reactive, computed를 활용해 필수 입력값 충족 여부와 약관 동의 상태에 따라 버튼 활성화가 자동으로 변경되도록 구현했습니다. 비밀번호 표시·숨김 같은 인터랙션도 상태 기반으로 처리했습니다. 입력창과 버튼은 공통 컴포넌트로 분리해 재사용성을 높였고, 에러·비활성·타입별 UI를 props로 제어할 수 있도록 설계했습니다. TailwindCSS로 모바일 퍼스트 레이아웃을 구성하고, 카드형 폼 구조와 컬러 시스템을 유틸리티 클래스 중심으로 정리해 일관된 UI를 유지했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa2.png",
          "size": "1920x1080"
        },
        {
          "type": "text",
          "content": "Nuxt3의 페이지 구조로 지갑 메인 화면을 구성하고, 상단 배너 영역은 슬라이더 컴포넌트로 공지/이벤트 배너를 순환 노출하도록 구현했습니다. 공지 팝업은 Pinia로 오늘 하루 보지 않기 같은 UI 상태를 관리하고, 사용자 액션에 따라 표시 여부가 즉시 반영되도록 처리했습니다. 지갑 요약(총 보유 자산, 지갑 주소 복사)과 코인 리스트는 스토어 상태를 기반으로 렌더링되며, 복사 기능은 클립보드 API를 연동해 버튼 한 번으로 동작하도록 구성했습니다. 하단 탭 바는 Nuxt 라우팅과 연결해 현재 활성 메뉴가 강조되도록 했고, TailwindCSS로 카드형 레이아웃, 간격, 타이포, 버튼 스타일을 유틸리티 클래스로 일관되게 정리해 모바일 UI 완성도를 높였습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa3.png",
          "size": "1920x1080"
        },
        {
          "type": "text",
          "content": "보내기 화면은 Nuxt3 라우팅으로 탭(지갑/보내기/쇼핑/교환/나의 정보) 이동이 자연스럽게 이어지도록 구성했고, 상단 헤더의 뒤로가기 동작은 `navigateTo`와 히스토리 기반으로 처리했습니다. 주요 액션(보내기, 내 지갑 주소, QR 보내기/받기)은 컴포넌트 단위로 분리해 재사용 가능하게 만들고, 클릭 이벤트는 Pinia 액션으로 연결해 상태 변화와 후속 처리를 일관되게 관리했습니다. QR 관련 흐름은 모달/페이지 전환 시 필요한 UI 상태를 Pinia에 두고, TailwindCSS로 카드형 버튼, 간격, 타이포, 하단 탭 바 활성 스타일을 유틸리티 클래스로 정리해 모바일 UI를 일관되게 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa4.png",
          "size": "2200x1080"
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa5.png",
          "size": "2200x1080"
        },
        {
          "type": "text",
          "content": "코인 목록 → 수량 입력 → 전송 확인으로 이어지는 보내기 플로우를 Nuxt3 라우팅 기준의 단계별 화면으로 구성했습니다. 코인 선택과 잔액 정보는 Pinia 스토어에서 관리해 각 단계로 이동해도 상태가 유지되도록 했고, 수량 입력은 커스텀 숫자 키패드 컴포넌트로 구현해 모바일 입력 정확도를 높였습니다. 전송 요약 화면에서는 가스비, 잔여 수량을 계산 값으로 즉시 반영해 사용자에게 명확한 확인 단계를 제공했으며, TailwindCSS로 카드형 레이아웃과 버튼 강조 스타일을 통일해 전체 전송 흐름이 자연스럽게 이어지도록 구성했습니다."
        },
        {
          "type": "text",
          "content": "보내기 최종 확인 → 전송키 입력 → 전송 완료로 이어지는 전송 마무리 플로우를 단계별 화면으로 구성했습니다. 전송 정보 요약 화면에서는 보내는 사람·받는 사람·수량·가스비·잔여 수량을 한 번에 확인할 수 있도록 정리해 실수 가능성을 줄였습니다. 전송키 입력 단계는 커스텀 숫자 키패드와 마스킹 UI로 구현해 보안성을 강화했고, 입력 상태는 Pinia에서 관리해 검증 후 다음 단계로만 이동하도록 제어했습니다. 전송 완료 화면에서는 결과 정보만 명확하게 노출하고 CTA를 최소화해 사용자가 흐름을 직관적으로 마무리할 수 있도록 구성했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa6.png",
          "size": "1500x1080"
        },
        {
          "type": "text",
          "content": "QR 기반 전송 흐름을 보내기·받기 두 단계로 구성했습니다. QR 보내기 화면에서는 카메라 인식 영역과 인증코드 입력을 병행할 수 있도록 설계해 인식 실패 상황에서도 흐름이 끊기지 않도록 했습니다. QR 받기 화면은 코드 자체를 중심으로 배치하고 동일한 인증코드 입력 방식을 유지해 양방향 UX의 일관성을 확보했습니다. 전 과정은 상태 값을 Pinia에서 관리해 QR 인식 여부와 인증코드 검증 결과에 따라 다음 단계로만 진행되도록 제어했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa7.png",
          "size": "2200x1080"
        },
        {
          "type": "text",
          "content": "쇼핑 기능은 상품 목록 → 상품 상세 → 주문 단계로 이어지는 흐름으로 구성했습니다. 상품 목록에서는 카드형 레이아웃과 할인 전·후 가격을 함께 노출해 비교가 쉽도록 했고, 상세 화면에서는 수량 조절과 총 금액이 즉시 반영되도록 설계했습니다. 주문 단계에서는 외부 주소 검색 팝업과 수령자 정보를 연동해 입력 부담을 줄였으며, 전체 구매 과정은 상태를 일관되게 관리해 결제 전까지 흐름이 자연스럽게 이어지도록 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa8.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "상품 주문 화면은 결제 수단 선택, 결제 금액 요약, 선택한 코인 기준의 필요 수량과 보유 수량 비교 흐름으로 구성했습니다. 결제 코인을 변경하면 환율 기준으로 필요 수량과 잔액 상태가 즉시 갱신되도록 했으며, 보유 수량이 부족한 경우와 결제가 가능한 경우를 시각적으로 구분해 사용자가 상태를 한눈에 인지할 수 있도록 설계했습니다. 결제 완료 이후에는 쇼핑내역 상세 화면에서 상품 정보, 주문자·수령자 정보, 결제 코인과 수량을 한 화면에 정리해 확인할 수 있도록 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa9.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "사용 흐름은 교환 목록에서 교환 금액을 입력한 뒤 수수료, 필요 금액, 교환 후 잔액을 확인하고 교환 완료 화면으로 이동하는 구조로 구성되어 있습니다. 금액 표시는 formatAmount(value, options) 유틸을 사용해 소수점 자리수 제어와 천 단위 콤마 포맷을 적용했습니다. 교환 수량 계산은 calcExchangeAmount(fromAmount, rate)를 통해 환율 기반으로 산출하며, 가스비(수수료)는 calcFee(fromAmount, feePolicy)를 기준으로 계산됩니다. 실제 차감 금액은 calcRequired(fromAmount, fee)를 통해 교환 금액과 수수료를 합산해 계산하고, 교환 이후 잔액은 calcAfterBalance(balance, required) 로직을 사용해 산출했습니다. 입력값은 clampAmount(input, min, max)를 통해 최소·최대 범위를 제한해 안정성을 확보했습니다. 상태 관리는 Pinia 기반으로 exchangeStore.selectedPair, exchangeStore.rate, exchangeStore.fee, exchangeStore.inputAmount, exchangeStore.summary를 중심으로 구성했으며, 화면 진입 시 선택 페어와 환율을 세팅하고 입력값 변경 시 요약 정보를 즉시 재계산한 뒤 다음 단계 진입 시 확인 데이터를 고정하는 방식으로 동작합니다. 환율 조회 및 교환 처리 로직은 서비스 레이어로 분리해 exchangeService.getRate(pair), exchangeService.preview({pair, amount}), exchangeService.confirm({pair, amount}) API를 통해 처리되도록 설계했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa9.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "본 화면은 TARA 코인을 TRX로 교환하는 전체 흐름을 시각화한 화면으로 교환 목록에서 코인 페어를 선택한 뒤 교환 금액을 입력하면 실시간 환율을 기준으로 교환 결과 수량이 계산되며 동시에 가스비를 포함한 필요 금액과 교환 후 잔액이 즉시 산출되도록 구성되어 있습니다 금액 표시는 formatAmount 유틸을 통해 소수점 자리수와 콤마 포맷을 통일하였고 calcExchangeAmount 함수로 환율 기반 교환 수량을 계산하며 calcFee 정책 함수로 수수료를 산출한 뒤 calcRequired 로 총 필요 금액을 계산하고 calcAfterBalance 로 교환 후 잔액을 계산합니다 입력 단계에서는 clampAmount 유틸을 사용해 최소 및 최대 입력값을 제한하였으며 상태 관리는 Pinia 기반 exchangeStore에서 selectedPair rate fee inputAmount summary 값을 관리합니다 화면 진입 시 exchangeService.getRate 로 환율을 조회하고 입력 변경 시 preview 로 계산 결과를 갱신하며 최종 확인 단계에서 confirm API를 호출해 교환을 확정하고 완료 및 내역 화면에 결과를 반영하도록 구현되어 있습니다"
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa10.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "교환 플로우는 교환 목록(페어 선택) → 교환 금액 입력(환율 표시) → 교환 확인(필요 금액/가스비/교환 후 잔액) → 전송키 6자리 입력 → 완료 → 교환 내역 확인 순서로 구성했습니다. 금액/표시는 formatAmount(value, options)로 소수점 자리수와 천단위 콤마를 통일했고, calcExchangeAmount(fromAmount, rate)로 교환 수량을 계산했으며, calcFee(fromAmount, feePolicy)로 가스비(수수료)를 산출하고 calcRequired(fromAmount, fee)로 필요 금액(교환금액+수수료)을 만든 뒤 calcAfterBalance(balance, required)로 교환 후 잔액을 계산했습니다. 입력값은 clampAmount(input, min, max)로 최소/최대 및 보유금액 범위 내로 제한하고, 전송키 화면은 pinKeypadInput(append/delete/reset) 로직으로 6자리 마스킹 처리와 완료 시 다음 단계로 이동하도록 설계했습니다. 교환 내역 시간 표시는 formatDateTime(isoString, locale) 유틸로 ISO 타임스탬프를 화면 표시 포맷으로 변환했습니다. 상태 관리는 Pinia의 exchangeStore에서 selectedPair, rate, fee, inputAmount, summary, pinCode를 보유하며, 화면 진입 시 pair/rate/fee를 세팅하고 입력 변경 시 summary를 재계산한 뒤 확인 단계에서 스냅샷을 고정하고 완료 후 목록/내역을 갱신하도록 흐름을 잡았습니다. 서비스 레이어는 exchangeService.getRate(pair), exchangeService.preview({pair, amount}), exchangeService.confirm({pair, amount, pin})로 분리해 화면은 얇게 유지하고 계산/검증/호출을 store/service로 위임했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa11.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "본 화면은 TARA Wallet의 ‘나의 정보’ 및 ‘회원정보 수정’ 기능을 구현한 UI 흐름으로, 상단 프로필 카드에서는 로그인된 사용자의 닉네임과 이메일 정보를 시각적으로 강조하여 노출하며 설정 아이콘을 통해 개인정보 수정 화면으로 진입하도록 구성되어 있습니다. 하단 리스트 영역에서는 관리자 로그인, 추천인, 후원인, 회원 문의, 쇼핑 내역 등 계정 관련 주요 메뉴를 카드형 리스트로 제공하여 접근성을 높였습니다. 회원정보 수정 화면에서는 회원 아이디는 읽기 전용으로 고정하고 비밀번호 및 전송 비밀번호는 별도의 변경 버튼을 통해 단계적으로 수정하도록 설계하였으며, 이메일, 회원명, 휴대폰 번호, 추천인 정보는 BaseInput 컴포넌트를 사용해 일관된 입력 경험을 제공합니다. 모든 입력값은 Pinia 기반 userStore에서 관리되며 초기 진입 시 사용자 정보를 fetchUserProfile API로 조회하여 상태를 세팅하고, 수정하기 버튼 클릭 시 updateUserProfile 서비스 함수를 통해 변경 사항만 서버로 전송하는 구조로 구현되었습니다. 비밀번호 변경은 별도의 confirm 플로우를 거쳐 보안 검증 후 반영되도록 분리 설계하여 보안성과 사용자 안정성을 동시에 확보하였습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa12.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "본 화면은 TARA Wallet의 추천인·후원인 조회 기능을 시각화한 UI입니다.사용자는 상단 검색 영역에서 사용자명 또는 ID로 대상 사용자를 조회할 수 있으며, 검색 결과는 리스트 형태로 즉시 표시되어 선택 후 하단 관계 구조로 이어집니다.추천인 화면에서는 선택한 사용자를 기준으로 상위 추천 관계와 하위 추천 트리가 카드형 노드로 표현되어 흐름을 한눈에 파악할 수 있도록 구성했습니다.후원인 화면에서는 선택한 사용자를 기준으로 후원 관계가 동일한 방식의 트리 구조로 노출되며, 핵심 대상 노드는 강조 스타일로 구분해 현재 조회 기준점을 명확히 전달합니다.각 노드는 아이디, 사용자명, 가입일 정보를 포함하고, 트리 레이아웃은 관계 깊이에 따라 자동으로 정렬되어 모바일 화면에서도 계층 구조가 무너지지 않도록 설계했습니다.검색어, 선택된 기준 사용자, 트리 데이터, 로딩 및 오류 상태는 Pinia 스토어에서 관리하며, 조회 요청은 service 레이어(referralService/sponsorService)로 분리해 API 호출과 UI 표현을 분리했습니다.또한 검색 입력과 결과 반영은 debounce 기반으로 처리해 불필요한 요청을 줄이고, 데이터 변경 시 트리 렌더링이 즉시 갱신되도록 구성하여 운영 환경에서도 안정적인 조회 경험을 제공하도록 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/tara-wallet/tawa13.png",
          "size": "2220x1080"
        },
        {
          "type": "text",
          "content": "본 화면은 회원 문의 기능의 전체 흐름을 보여주는 UI입니다.사용자는 문의하기 탭에서 제목과 내용을 입력해 문의를 등록할 수 있으며, 제목은 최대 50자, 내용은 최대 2000자로 제한됩니다. 입력 길이는 실시간으로 카운트되어 사용자가 작성 분량을 명확히 인지할 수 있도록 구성하였습니다.문의내역 탭에서는 사용자가 등록한 문의 목록을 확인할 수 있으며, 각 항목에는 문의 제목, 작성일, 답변 상태(답변 미완료)가 표시됩니다. 목록 아이템을 선택하면 상세 화면으로 이동합니다.문의 상세 화면에서는 문의 제목, 작성일, 문의 내용이 상단에 노출되며, 하단에는 관리자 답변 영역이 분리되어 표시됩니다. 답변이 등록되지 않은 경우 ‘답변 대기 중’ 안내 문구를 통해 현재 상태를 명확히 전달합니다.하단 액션 영역에는 문의 삭제 버튼과 목록으로 이동 버튼을 배치하여 사용자가 다음 행동을 직관적으로 선택할 수 있도록 설계하였습니다.상태 관리는 Pinia를 통해 문의 목록, 선택된 문의 상세 데이터, 답변 상태를 관리하며, 문의 등록·삭제·조회는 service 레이어를 통해 API와 분리하여 처리하였습니다. 이를 통해 화면은 UI 표현에 집중하고, 비즈니스 로직은 명확하게 분리된 구조로 구현하였습니다."
        }
      ]
    },
    {
      "title": "SAMSUNG PLATFORM",
      "img": "/images/samsung.png",
      "info": ["Crypto Exchange Platform with Vue3", "타라소프트"],
      "position": ["Front-end", "Back-end"],
      "date": ["NOVEMBER", "2025"],
      "collaborator": ["MIN", "X", "HYUN"],
      "url": "",
      "color": "#7a5af8",
      "post": [
        {
          "type": "image",
          "content": "/images/samsung.png",
          "size": "1207×624"
        },
        {
          "type": "text",
          "content": "삼성플랫폼은 디지털 자산 관리와 전송을 중심으로 한 웹 기반 플랫폼으로, 사용자와 관리자가 각각의 목적에 맞게 지갑 관리, 코인 지급·전송, 거래 내역 확인 등을 효율적으로 수행할 수 있도록 설계된 서비스입니다. 본 프로젝트에서 본인은 프론트엔드 아키텍처 설계 및 개발을 중심으로, 관리자·사용자 화면 구현, UI/UX 구조 설계, 그리고 서비스 운영을 위한 도메인 설정 및 클라우드 환경 배포까지 전반적인 역할을 담당하였습니다."
        },
        {
          "type": "image",
          "content": "/images/samsung/sf1.png",
          "size": "800x1400"
        },
        {
          "type": "text",
          "content": "본 화면은 Nuxt3(Vue3) 기반의 코인 지갑 홈 대시보드로, 상단 요약 카드에서 사용자 닉네임과 보유 자산(WDON, CCO, TARA) 잔액을 한 번에 확인하도록 구성했습니다. Pinia의 userStore/walletStore에서 사용자 프로필과 잔액 상태를 관리하며, 진입 시 fetchWalletSummary 서비스 함수로 지갑 정보를 조회한 뒤 computed로 화면 표시용 데이터(심볼, 소수점 자리, 단위)를 파생합니다. 숫자 표현은 formatCoinAmount 유틸로 자릿수와 소수점 정리를 통일했고, 주소복사는 useClipboard 컴포저블로 원터치 복사 후 alertModal로 피드백을 제공하도록 구현했습니다. 하단 메뉴 영역은 TailwindCSS의 grid와 spacing 유틸을 활용해 거래내역, 코인목록, 전송, 교환/내역 등 주요 기능을 카드형 아이콘 메뉴로 배치하여 모바일에서 빠른 탐색이 가능하도록 설계했습니다. 공통 버튼과 입력 계열은 Base 컴포넌트로 일관된 UI/UX를 유지했으며, 라우팅은 navigateTo 기반으로 기능별 페이지로 자연스럽게 연결되도록 구성했습니다."
        },
        {
          "type": "image",
          "content": "/images/samsung/sf2.png",
          "size": "800x1400"
        },
        {
          "type": "text",
          "content": "본 화면은 Nuxt3(Vue3) 기반으로 구현한 코인 교환 기능 UI로, 사용자가 보유한 코인을 TARA 코인으로 교환하는 흐름을 직관적으로 이해할 수 있도록 설계했습니다. 상단 탭 영역에서는 교환과 교환 내역을 분리해 상태를 관리하며, Pinia의 exchangeStore에서 선택된 코인 타입(WDON, CCO), 입력 수량, 교환 결과 값을 단일 상태로 관리합니다. 교환할 코인 선택 버튼은 computed로 활성 상태를 제어해 선택된 코인이 시각적으로 강조되도록 처리했고, 현재 보유 코인은 fetchWalletBalance API 호출 결과를 기반으로 실시간 반영합니다. 입력 영역은 BaseInput 컴포넌트를 사용해 수량과 전송 비밀번호를 분리 구성했으며, 입력값 변경 시 calculateExchangeAmount 유틸을 통해 교환 후 잔액과 사용 예정 수량을 즉시 계산해 하단에 노출합니다. 교환 신청 버튼은 입력값 검증과 잔액 체크를 통과한 경우에만 활성화되도록 설계해 사용자 실수를 방지했으며, 전체 레이아웃은 TailwindCSS의 spacing과 card 스타일을 활용해 모바일 환경에서도 안정적인 가독성과 사용성을 확보한 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/samsung/sf3.png",
          "size": "800x1400"
        },
        {
          "type": "text",
          "content": "본 화면은 Nuxt3(Vue3) 기반으로 구현한 코인 교환 기능 중 오류 상태를 포함한 UI 흐름으로, 사용자가 보유 수량을 초과해 교환을 시도했을 때 즉각적인 피드백을 제공하도록 설계했습니다. Pinia의 exchangeStore에서 선택된 코인(CCO), 입력 수량, 보유 잔액 정보를 통합 관리하며, 입력값 변경 시 watch 로직을 통해 보유 수량과 비교 검증을 수행합니다. 입력한 수량이 잔액을 초과하는 경우 validateExchangeAmount 유틸을 통해 에러 상태를 반환하고, 해당 메시지를 인풋 하단에 즉시 노출해 사용자가 문제를 인지하도록 처리했습니다. 수량 입력과 전송 비밀번호 입력 영역은 BaseInput 컴포넌트를 사용해 일관된 입력 경험을 제공했으며, 교환 후 잔액과 사용 예정 수량은 calculateExchangeAmount 함수로 실시간 계산해 하단에 반영합니다. 교환 신청 버튼은 에러 상태가 해소되기 전까지 비활성화되도록 제어했으며, 전체 레이아웃은 TailwindCSS의 spacing과 카드 스타일을 활용해 오류 상황에서도 가독성과 사용성을 유지하도록 구성한 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/samsung/sf4.png",
          "size": "800x1400"
        },
        {
          "type": "text",
          "content": "본 화면은 Nuxt3(Vue3) 기반으로 구현한 코인 교환 내역 조회 UI로, 사용자의 자산 이동 이력을 시간 순으로 명확하게 확인할 수 있도록 설계했습니다. 상단 탭에서는 교환과 교환 내역 상태를 분리해 관리하며, Pinia의 exchangeHistoryStore에서 교환 타입(CCO→TARA, WDON→TARA), 수량 증감, 상태 값을 리스트 형태로 관리합니다. 화면 진입 시 fetchExchangeHistory API를 호출해 데이터를 조회하고, 날짜 기준으로 정렬한 뒤 computed를 통해 화면 출력용 데이터로 가공합니다. 각 내역 카드는 TailwindCSS의 card 스타일과 spacing 유틸을 활용해 시각적으로 구분했으며, 코인 차감과 지급 내역은 컬러와 기호를 달리해 직관적으로 인지할 수 있도록 구성했습니다. 교환 완료 상태는 status 뱃지로 표시해 처리 결과를 한눈에 확인할 수 있도록 했고, 스크롤 영역에서는 가상 리스트 구조를 적용해 데이터가 많아져도 성능 저하 없이 동작하도록 설계했습니다. 전체 UI는 모바일 환경에서 가독성과 안정성을 중점으로 구성했습니다."
        },
        {
          "type": "text",
          "content": "코인 전송 플로우는 TARA WALLET 프로젝트 섹션에서 상세하게 다룰 예정이며, 로그인·회원가입·문의·공지 등은 일반적인 서비스에서 공통적으로 사용되는 기본 기능이므로 본 포트폴리오 설명에서는 별도로 기술하지 않았습니다."
        }
      ]
    },
    {
      "title": "WINIX",
      "img": "/images/winix.jpg",
      "info": [
        "Development of the official website for the home appliance company 'WINIX'",
        "그루마케팅"
      ],
      "position": ["Front-end"],
      "date": ["FEBRUARY", "2025"],
      "collaborator": ["MIN"],
      "url": "https://www.winix.com/",
      "color": "#242056",
      "post": [
        {
          "type": "image",
          "content": "/images/winix2.jpg",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "종합생활가전 기업 위닉스(WINIX)의 공식 브랜드 사이트 리뉴얼 프로젝트에 참여하여 신규 C.I(Corporate Identity) 적용과 함께 전반적인 웹 구조 및 UI/UX를 재정비하였습니다. 기존의 딱딱한 가전 브랜드 이미지를 탈피하고, 젊고 진보적인 브랜드 방향성을 효과적으로 전달하기 위해 트렌디한 모던 비주얼과 친환경적인 디자인 콘셉트를 웹 전반에 반영하였습니다. 시즌별 주요 제품을 사용자가 직관적으로 확인할 수 있도록 메인 화면 구조를 개선하였으며, 정보 탐색 및 구매 동선을 단순화하여 사용자 접근성과 사용성을 향상시켰습니다. 또한 불필요한 화면 흐름을 최소화하고 소비자에게 가장 필요한 정보를 우선적으로 제공하는 UI/UX 구조를 구현함으로써, 개편된 C.I를 효과적으로 전달하고 브랜드 아이덴티티를 재정립한 공식 홈페이지를 구축하였습니다."
        },
        {
          "type": "image",
          "content": "/images/winix/w1.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "메인 화면입니다. 라우팅과 페이지 렌더링은 Nuxt의 SSR/CSR 하이브리드 구조를 활용해 초기 진입 속도와 SEO를 함께 고려했습니다. 전역 상태는 Pinia로 분리 관리하여 로그인 세션, 장바구니 수량, 헤더 유틸 메뉴 상태, 메인 배너/기획전 데이터 등을 store 단위로 유지했고, 페이지 진입 시 useAsyncData와 service 레이어(fetchHomeBanners, fetchEventList, fetchLiveList 등)로 데이터를 조회해 화면에 바인딩했습니다. 메인 배너 슬라이더와 카드형 섹션은 공통 컴포넌트로 컴포넌트화하여 운영 콘텐츠 교체가 쉽도록 구성했으며, TailwindCSS로 그리드/간격/반응형을 빠르게 설계해 동일한 디자인 규칙을 유지했습니다. 사용자 액션(로그인, 검색, 장바구니, 내 정보)은 composable(useAuth, useCart, useTracking)을 통해 로직을 재사용 가능하게 분리했고, 숫자/가격 표시는 formatCurrency, formatDate 유틸로 일관된 포맷을 적용해 실제 서비스 운영에서 발생하는 데이터 표현 혼선을 줄였습니다."
        },
        {
          "type": "image",
          "content": "/images/winix/w2.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "콘텐츠 영역은 제품 관리 서비스, 시즌성 프로모션, 리뷰, 콘텐츠, 라이브 영역을 하나의 흐름으로 자연스럽게 연결해 구성했습니다. 각 섹션 데이터는 Pinia의 homeStore에서 관리하며, 진입 시 useAsyncData를 통해 fetchCareServiceList, fetchPromotionBanner, fetchReviewList, fetchContentList, fetchLiveInfo API를 병렬로 호출해 초기 로딩 성능을 확보했습니다. 카드형 UI는 공통 컴포넌트로 분리해 제품 이미지, 타이틀, 액션 버튼 구조를 통일했고, TailwindCSS 그리드와 spacing 유틸을 활용해 해상도별 반응형 레이아웃을 구현했습니다. 시즌 배너와 라이브 영역은 운영자가 교체 가능한 데이터 구조로 설계해 관리자 변경 사항이 즉시 반영되도록 했으며, 리뷰 영역은 이미지 기반 리스트를 구성해 스크롤 시 자연스럽게 노출되도록 처리했습니다. 각 섹션 간 전환은 navigateTo 기반으로 상세 페이지와 연결되고, 전체 구성은 마케팅·콘텐츠·커머스 요소를 유기적으로 결합해 실제 서비스 운영에 최적화된 구조로 개발했습니다."
        },
        {
          "type": "image",
          "content": "/images/winix/w3.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "제품 목록 페이지로는 메인 비주얼 배너와 MD PICK 영역, 필터링 가능한 상품 리스트를 하나의 흐름으로 구성했습니다. 상단 히어로 배너는 useAsyncData를 통해 fetchCategoryBanner API로 데이터를 받아 렌더링하며, 시즌별 문구와 이미지는 서버 데이터 변경만으로 교체되도록 설계했습니다. MD PICK 영역은 Pinia의 productStore에서 관리하는 추천 상품 리스트를 사용해 카드 컴포넌트로 노출하고, 각 카드에는 평점, 리뷰 수, 인증 배지 상태를 함께 바인딩했습니다. 좌측 필터 영역은 타입, 적용 면적, 필터 여부, 가격 범위를 조건으로 구성했으며, 필터 값은 store에 상태로 저장해 변경 시 watch를 통해 fetchProductList API를 재호출하는 구조로 구현했습니다. 상품 리스트는 그리드 기반으로 렌더링되며, 정렬 옵션(신상품순 등)은 computed로 파생해 반영합니다. 각 상품 카드의 비교하기, 구매하기 액션은 공통 로직으로 처리해 페이지 이동과 장바구니 연동이 자연스럽게 이어지도록 구성했고, TailwindCSS를 활용해 대량 상품 노출 환경에서도 일관된 간격과 반응형 레이아웃을 유지하도록 개발했습니다."
        }
      ]
    },
    {
      "title": "DAVICH",
      "img": "/images/davich.png",
      "info": [
        "Development of the official website for the optical retail brand 'DAVICh'",
        "그루마케팅"
      ],
      "position": ["Front-end"],
      "date": ["AUGUST", "2024"],
      "collaborator": ["MIN"],
      "url": "https://davich.com/",
      "color": "#07377e",
      "post": [
        {
          "type": "image",
          "content": "/images/davich.png",
          "size": "800×450"
        },
        {
          "type": "text",
          "content": "안경 전문 브랜드 다비치안경의 공식 홈페이지 리뉴얼 프로젝트를 진행하였습니다. 기존 사이트의 정보 구조를 재정비하고, 브랜드가 지향하는 신뢰성과 전문성을 보다 직관적으로 전달할 수 있도록 UI/UX 전반을 개선하였습니다. 메인 비주얼 영역에서는 다비치의 브랜드 아이덴티티와 헬스케어 이미지를 강조한 대형 비주얼과 인터랙션 요소를 적용하였으며, 제품 카테고리별 접근성을 높이기 위해 사용자 동선을 단순화하였습니다. 또한 다양한 디바이스 환경에서도 일관된 사용자 경험을 제공할 수 있도록 반응형 웹 구조로 구현하였으며, 콘텐츠 가독성과 정보 전달력을 고려한 레이아웃 설계를 통해 브랜드 사이트로서의 완성도를 높였습니다."
        },
        {
          "type": "image",
          "content": "/images/davich/d1.png",
          "size": "2600x1600"
        },
        {
          "type": "text",
          "content": "첫 진입 시 브랜드 메시지를 강하게 전달하기 위해 영상 기반 히어로 섹션을 중심으로 설계했습니다. 상단 메인 비주얼은 video 태그를 활용한 배경 영상 구조로 구현했으며, 자동 재생·무음·루프 옵션을 적용해 사용자의 인터랙션 없이도 자연스럽게 노출되도록 처리했습니다. 영상 로딩 상태는 useVideoControl 컴포저블로 관리해 초기 로딩 시 깜빡임을 최소화했고, 슬라이드 인디케이터와 재생 상태는 reactive 상태로 제어했습니다. 메인 카피 문구와 서브 텍스트는 CMS에서 내려오는 데이터를 바인딩해 시즌별 메시지 교체가 가능하도록 구성했으며, 상단 글로벌 내비게이션은 Pinia의 uiStore에서 메뉴 활성 상태를 관리해 스크롤 및 페이지 이동 시 일관된 UX를 유지했습니다. 전체 레이아웃은 TailwindCSS를 활용해 대형 화면에서도 영상 비율과 텍스트 가독성이 유지되도록 반응형으로 설계했으며, 브랜드 이미지 중심의 메인 경험을 우선하는 구조로 개발했습니다."
        },
        {
          "type": "image",
          "content": "/images/davich/d2.png",
          "size": "2600x1600"
        },
        {
          "type": "text",
          "content": "메인 페이지의 핵심 지표 섹션으로, 브랜드 신뢰도를 수치로 직관적으로 전달하는 영역입니다. 상단 히어로 영상 영역과 자연스럽게 이어지도록 단일 페이지 흐름 안에 배치했으며, 각 지표 데이터는 Pinia의 statisticsStore에서 관리합니다. 페이지 진입 시 useAsyncData를 통해 fetchBrandStatistics API를 호출해 가맹점 수, 누적 고객 수, 지킴이 안경 수, 고객 수 등의 데이터를 조회하고, 숫자 증감 애니메이션은 useCountUp 컴포저블을 활용해 스크롤 진입 시점에 맞춰 동작하도록 구현했습니다. 각 항목은 공통 StatisticCard 컴포넌트로 구성해 레이아웃과 타이포 규칙을 통일했고, TailwindCSS를 사용해 대형 화면에서도 균형 잡힌 간격과 가독성이 유지되도록 반응형으로 설계했습니다. 상단 네비게이션은 Pinia uiStore를 통해 활성 상태와 버튼 노출을 제어해 메인 콘텐츠와 시각적 충돌 없이 동작하도록 구성했습니다."
        },
        {
          "type": "image",
          "content": "/images/davich/d3.png",
          "size": "2600x1600"
        },
        {
          "type": "text",
          "content": "메인 페이지 제품 카테고리 진입 영역으로, 브랜드의 주요 상품군을 시각적으로 구분해 한눈에 탐색할 수 있도록 설계했습니다. 각 영역은 안경테·안경렌즈·콘택트렌즈·보청기 카테고리로 구성되어 있으며, 공통 CategoryBanner 컴포넌트를 사용해 이미지, 카테고리명, CTA 버튼 구조를 통일했습니다. 카테고리 데이터와 링크 정보는 Pinia의 categoryStore에서 관리하고, 초기 로딩 시 fetchMainCategory API를 통해 서버 데이터를 받아 렌더링합니다. 사용자가 영역에 마우스를 올리거나 포커스할 경우 TailwindCSS 기반 트랜지션 효과로 버튼과 강조선이 노출되도록 처리해 인터랙션을 명확히 했습니다. 각 카테고리 클릭 시 navigateTo를 통해 상세 상품 리스트 페이지로 이동하며, 전체 레이아웃은 대형 이미지 비율을 유지하면서도 해상도별로 자연스럽게 분할되도록 반응형으로 구성해 실제 서비스 환경에서 안정적으로 동작하도록 개발했습니다."
        },
        {
          "type": "text",
          "content": "다비치 공식 홈페이지는 제품 직접 판매보다는 브랜드의 정체성과 신뢰도를 전달하는 기업 중심 플랫폼으로, 기업 소개, 브랜드 히스토리, 광고 캠페인, 사회공헌 활동, 가맹점 안내 등 대외 커뮤니케이션 역할에 집중한 구조로 설계했습니다. 실제 상품 리스트 조회와 구매 전환은 별도 커머스 채널인 다비치마켓에서 이루어지도록 명확히 분리해, 공식 홈페이지에서는 브랜드 메시지 전달과 고객 신뢰 형성에 초점을 맞췄습니다. 본 프로젝트에서는 이러한 역할 구분을 전제로 공식 홈페이지 영역만 담당해 개발했으며, 메인 영상, 브랜드 지표, 카테고리 안내, 콘텐츠 섹션 등을 통해 다비치가 어떤 기업인지 직관적으로 이해할 수 있도록 화면 흐름과 정보 구조를 구성했습니다. 커머스 기능과 혼재되지 않도록 동선과 CTA를 정리해, 브랜드 사이트로서의 목적이 명확히 드러나는 실제 운영 환경에 맞는 공식 홈페이지를 구현했습니다."
        }
      ]
    },
    {
      "title": "ZAKSIM",
      "img": "/images/zaksim.png",
      "info": [
        "Development of the official website for the premium study cafe brand 'ZAKSIM'",
        "그루마케팅"
      ],
      "position": ["Front-end"],
      "date": ["MAY", "2024"],
      "collaborator": ["MIN"],
      "url": "https://www.zaksim.co.kr/",
      "color": "#dd9c53",
      "post": [
        {
          "type": "image",
          "content": "/images/zaksim.png",
          "size": "718×467"
        },
        {
          "type": "text",
          "content": "작심(ZAKSIM) 공식 웹사이트 리뉴얼을 진행하여 서비스 소개부터 콘텐츠 탐색, 주요 기능 안내까지 전반적인 정보 구조를 재정비하였습니다. 사용자가 원하는 콘텐츠에 더 빠르게 도달할 수 있도록 메뉴 구성과 화면 흐름을 단순화하고, 핵심 메시지가 명확히 전달되도록 레이아웃과 시각 요소를 개선하였습니다. 또한 다양한 해상도와 디바이스 환경에서 일관된 경험을 제공하기 위해 반응형 UI를 적용하고, 유지보수와 확장성을 고려한 컴포넌트 기반 구조로 화면을 구성하여 운영 효율을 높였습니다."
        },
        {
          "type": "image",
          "content": "/images/zaksim/z1.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "메인 비주얼 영역으로, 브랜드 아이덴티티와 공간 콘셉트를 직관적으로 전달하는 데 초점을 맞춰 구성했습니다. Nuxt3(Vue3) 기반으로 구현해 초기 로딩 속도와 안정적인 렌더링을 확보했으며, 메인 히어로 영역은 실제 오프라인 공간 이미지를 중심으로 브랜드 슬로건과 핵심 메시지를 강조하는 구조로 설계했습니다. 상단 네비게이션은 작심소개, 차별화, 사회공헌, 가맹문의 등 브랜드 이해와 가맹 전환에 필요한 정보 위주로 구성하고, Pinia의 uiStore를 활용해 메뉴 활성 상태와 CTA 버튼 노출을 일관되게 관리했습니다. 메인 카피와 버튼 영역은 콘텐츠 교체가 용이하도록 데이터 바인딩 구조로 설계해, 캠페인이나 가맹 프로모션 변경 시 빠르게 대응할 수 있도록 구현했습니다. 전체 레이아웃은 TailwindCSS를 활용해 대형 화면에서도 공간감과 몰입도가 유지되도록 반응형으로 구성했으며, 브랜드 신뢰도와 가맹 문의 전환을 동시에 고려한 실제 운영 목적의 공식 홈페이지 메인 화면입니다."
        },
        {
          "type": "image",
          "content": "/images/zaksim/z2.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "메인 화면의 브랜드 소개 섹션으로, 스터디카페·독서실이라는 업종 특성보다 브랜드 철학과 공간 아이덴티티를 전달하는 데 초점을 맞춰 설계했습니다. 대형 이미지와 텍스트 중심 콘텐츠에서도 안정적인 렌더링과 스크롤 흐름을 유지했으며, 상단 영역에서는 브랜드 히스토리와 핵심 메시지를 텍스트 중심으로 정리하고 하단으로 내려갈수록 실제 공간 이미지와 시그니처 공간을 단계적으로 노출하는 구조를 적용했습니다. 이미지 섹션은 컴포넌트 단위로 분리해 Pinia의 contentStore를 통해 섹션별 데이터와 노출 순서를 관리하며, 운영 중 콘텐츠 추가·교체가 용이하도록 설계했습니다. 레이아웃은 TailwindCSS를 활용해 좌우 비주얼 대비와 여백을 명확히 가져가 브랜드의 프리미엄 이미지를 강화했고, 단순한 정보 나열이 아닌 브랜드 경험을 전달하는 소개용 페이지로 구현했습니다."
        },
        {
          "type": "image",
          "content": "/images/zaksim/z3.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "가맹 안내 핵심 섹션으로, 예비 가맹점주에게 브랜드 경쟁력과 사업 신뢰도를 직관적으로 전달하는 데 목적을 두고 구현했습니다. 대형 배경 이미지 위에 핵심 메시지와 아이콘 정보를 안정적으로 오버레이했으며, 각 강점 항목은 공통 Card 컴포넌트로 설계해 Pinia의 franchiseStore에서 데이터만 제어하는 구조로 구현했습니다. 업계 유일 직영점 중심 운영, 중앙 무인관제 서비스, 누적 투자 유치, 자체 SaaS 프로그램, 교육 콘텐츠 제공 등 핵심 지표는 시각적 아이콘과 함께 배치해 빠른 이해를 유도했고, 하단 CTA 영역은 스크롤 흐름상 자연스럽게 가맹 상담 신청으로 이어지도록 구성했습니다. TailwindCSS를 활용해 텍스트 대비와 반투명 카드 스타일을 정교하게 조정했으며, 실제 운영 중인 가맹 페이지로서 정보 전달과 전환 유도를 동시에 만족시키는 구조로 개발되었습니다."
        },
        {
          "type": "image",
          "content": "/images/zaksim/z4.png",
          "size": "3000x3000"
        },
        {
          "type": "text",
          "content": "본 화면은 작심 가맹 상담 신청 페이지로, 예비 가맹점주의 정보를 체계적으로 수집하고 실제 상담 전환으로 이어지도록 설계된 핵심 전환 화면입니다. 폼 구조를 구현했으며, 입력 영역은 공통 BaseInput·BaseSelect 컴포넌트를 사용해 시각적 일관성과 입력 안정성을 확보했습니다. 성함, 연락처, 지역, 임대 형태 등 기본 정보와 함께 사업 경험과 사업관에 대한 서술형 질문을 단계적으로 배치해 단순 문의가 아닌 진지한 가맹 검토자를 선별할 수 있도록 구성했습니다. 입력 데이터는 Pinia의 franchiseFormStore에서 상태로 관리하며, 제출 시 validateFranchiseForm 유틸을 통해 필수값과 형식을 검증한 뒤 상담 신청 API로 전송되는 구조입니다. 상단 히어로 영역과 하단 CTA 버튼은 사용자의 심리 흐름을 고려해 배경 이미지–폼–신청 버튼으로 자연스럽게 이어지도록 설계했으며, 실제 운영 환경에서 가맹 문의 전환과 관리 효율을 동시에 고려한 상담 신청 페이지입니다."
        }
      ]
    },
    {
      "title": "FOCUS",
      "img": "/images/focus.png",
      "info": ["To Do List", "연습"],
      "position": ["Front-end"],
      "date": ["JANUARY", "2024"],
      "collaborator": ["MIN"],
      "url": "https://parkhy0sh1n.github.io/Focus/",
      "color": "#1d1d1f",
      "post": [
        {
          "type": "image",
          "content": "/images/focus.png",
          "size": "800×572"
        },
        {
          "type": "text",
          "content": "하루에 하지 말아야 할 리스트를 작성하여, 불필요한 일, 목표를 달성하는 데 도움이 되지 않는 일, 장기적으로 이익이 되지 않는 일을 구별하여 중요한 것에 한눈을 팔지 않고 더 집중할 수 있도록 만든 앱입니다"
        },
        {
          "type": "image",
          "content": "/images/focus1.jpg",
          "size": "2159x1334"
        },
        {
          "type": "text",
          "content": "FOCUS는 HTML, CSS, JavaScript만으로 구현한 연습용 Focus 앱의 초기 진입 화면으로, 사용자가 하루에 하지 말아야 할 행동을 정리해 불필요한 일을 줄이고 목표에 집중할 수 있도록 돕는 흐름을 담았습니다. 첫 화면을 채팅형 인터페이스로 구성해 진입 장벽을 낮췄고, 인사 메시지 이후 이름을 입력받아 개인화된 문장과 안내가 이어지도록 설계했습니다. 메시지 출력과 입력 이벤트는 순수 JavaScript로 제어하며, 대화 단계는 step 기반 상태로 관리해 다음 질문으로 자연스럽게 전환됩니다. 사용자가 작성하는 ‘하지 말아야 할 리스트’는 불필요한 일, 목표 달성에 도움이 되지 않는 일, 장기적으로 이익이 되지 않는 일로 구분해 저장되며, 이후 화면에서 한눈에 정리해 보여주는 구조로 확장 가능하도록 설계했습니다. UI는 CSS로 말풍선 형태와 레이아웃을 직접 구현해 간결한 화면 구성과 가독성을 확보했으며, 외부 프레임워크 없이 핵심 인터랙션과 상태 흐름을 구현하는 연습 목적에 맞춰 기본기에 집중한 앱입니다."
        },
        {
          "type": "image",
          "content": "/images/focus2.jpg",
          "size": "2159x1334"
        },
        {
          "type": "image",
          "content": "/images/focus3.jpg",
          "size": "2159x1334"
        },
        {
          "type": "text",
          "content": "프로필 사진과 이름을 사용자가 직접 변경할 수 있어 개인화된 사용 경험을 제공합니다. 목표(하지 말아야 할 일) 리스트는 추가/수정/삭제가 자유롭게 가능하며, 각 항목을 체크하면 진행 중 목록에서 완료된 목표로 즉시 이동하도록 구성해 ‘현재 관리해야 할 항목’과 ‘이미 정리된 항목’을 명확히 분리했습니다. 화면 우측의 정보 카드(시간/날씨 등)는 대시보드 성격의 보조 정보를 제공해 사용 맥락을 유지하도록 했고, 전체적으로는 순수 HTML·CSS·JavaScript 기반으로 입력 이벤트, 항목 상태 토글, 리스트 렌더링 갱신 흐름을 직접 구현하여 기본 기능을 안정적으로 동작시키는 데 초점을 맞췄습니다."
        },
        {
          "type": "image",
          "content": "/images/focus4.jpg",
          "size": "2159x1334"
        },
        {
          "type": "image",
          "content": "/images/focus5.jpg",
          "size": "2159x1334"
        },
        {
          "type": "image",
          "content": "/images/focus6.jpg",
          "size": "2159x1334"
        },
        {
          "type": "text",
          "content": "간단한 그림판 기능이 포함되어 있습니다. 사용자는 펜 도구를 이용해 자유롭게 그림이나 메모를 작성할 수 있으며, 색상 선택과 선 굵기 조절 기능을 통해 원하는 스타일로 표현할 수 있습니다. 지우기 및 초기화 기능을 제공해 수정이 용이하고, 작업이 완료된 후에는 캔버스를 이미지로 저장할 수 있도록 구현했습니다. 해당 그림판 기능은 HTML의 canvas 요소와 CSS, JavaScript만을 활용해 제작된 연습용 기능으로, 목표 관리 앱 내에서 시각적인 집중을 돕는 보조 도구 역할을 합니다."
        }
      ]
    }
  ]
}
